In [1]:
# Create 'd', a nested list that contains 5 other lists. The first list should contain the four string values: ID, Age, is_part_time, salary. The next 4 lists should contain date of types: int, int, boolean, int. For example [3, 35, False, 72000]. Populate these 4 remaining lists with your own made-up data.
d = ["2345", "Yes", "No", "150000"],[3, 9, False, 2034],[76, 82, False, 964],[561, 284, True, 759],[68, 83, False, 46]
d

(['2345', 'Yes', 'No', '150000'],
 [3, 9, False, 2034],
 [76, 82, False, 964],
 [561, 284, True, 759],
 [68, 83, False, 46])

In [2]:
# Print your current working directory to the console.
import os

os.getcwd()

'C:\\Users\\bnana'

In [23]:
#Using Python's csv module, write 'd' to disk as a csv file. Use the method writerows() to write the nested list structure.

import csv


with open('d.csv', 'w') as file:
    
#building up the csv writer 
    writer = csv.writer(file)

#inserting d value in the csv file.
    writer.writerow(d)

In [29]:
#Using pandas module, load the same csv file into 'd2', and print d2.
import pandas as pd

d2 = pd.read_csv("d.csv", header = None)


d2

,0,1,2,3,4
0,"['2345', 'Yes', 'No', '150000']","[3, 9, False, 2034]","[76, 82, False, 964]","[561, 284, True, 759]","[68, 83, False, 46]"

In [35]:
#Create a Series 'd' containing 5 values, 0 through 4 inclusive, in increments of 1, with indexes 'a' through 'e', inclusive.
d = {'a': 0, 'b' : 1, 'c' : 2, 'd': 3,'e' : 4}
d = pd.Series(data=d, index =['a', 'b', 'c', 'd', 'e'])
d

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [41]:
#Create a 'd2' containing 5 values, 5 through 9 inclusive, with indexes: a,b,c,d,z.

d2 = pd.Series(range(5,10), index =['a', 'b', 'c', 'd', 'z'])
d2

a    5
b    6
c    7
d    8
z    9
dtype: int64

In [42]:
#Arithmetically add d and d2, save in 'd3', and print d3 to console. You should see two NaN values at the end of d3.
d3 = d + d2
d3

a     5.0
b     7.0
c     9.0
d    11.0
e     NaN
z     NaN
dtype: float64

In [45]:
#Using a Panda's method, identify which values in d3 contain NaN. Usingthat information, print only those NaN values in d3 to console.

#This is used to convert the series to DataFrame
d3 = d3.to_frame()

#print rows that do not contain a number
print(d3[d3[0].isna()])

    0
e NaN
z NaN

In [47]:
#Pandas come with a few built-in DataFrame objects. Assign the following built-in DataFrame to variable 'd4': pd.util.testing.makeMixedDataFrame(). Print d4 to console.
d4 = pd.util.testing.makeMixedDataFrame()
d4

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

In [50]:
#Determine which elements in column 'A' are greater than 2, and store the result in a new column in d4 called 'greater'. Print d4 to console.
d4['greater'] = d4['A'] > 2 
d4

     A    B     C          D  greater
0  0.0  0.0  foo1 2009-01-01    False
1  1.0  1.0  foo2 2009-01-02    False
2  2.0  0.0  foo3 2009-01-05    False
3  3.0  1.0  foo4 2009-01-06     True
4  4.0  0.0  foo5 2009-01-07     True